#2. update_status.py: Проверка и обновление статуса заметки
#Функциональность:
#Показывает текущий статус заметки.
#Предлагает изменить статус на один из предложенных.
#Обрабатывает некорректный ввод.

print("Заметка:")
note_names = {'name': 'Имя:', 'title': 'Заголовок:', 'content': 'Описание:', 'status':
    'Статус:', 'created_date': 'Дата создания:', 'issue_date': 'Дедлайн:'}
note_ = {'name': 'Елена', 'title': 'Покупки', 'content': 'Составить список покупок на неделю', 'status':
    'В процессе', 'created_date': '01-01-2025', 'issue_date': '15-01-2025'}
for key, value in note_.items():    #использование цикла для вывода заметки
    print(note_names[key], value)

print('Введите новый статус заметки, указав его название:')    #предложение поменять статус с указанными вариантами
print('1. Выполнено')
print('2. В процессе')
print('3. Отложено')

while True:     #использование цикла для ввода нового статуса заметки
    status = input('Ваш выбор: ')
    if status.lower() == 'выполнено':
        note_['status'] = 'Выполнено'
        print('Статус заметки успешно обновлён на: "Выполнено"!')
        break
    if status.lower() == 'в процессе':
        note_['status'] = 'В процессе'
        print('Статус заметки успешно обновлён на: "В процессе"!')
        break
    if status.lower() == 'отложено':
        note_['status'] = 'Отложено'
        print('Статус заметки успешно обновлён на: "Отложено"!')
        break
    else:   #подсказки в случае ввода некорректных данных
        print('Вы указали некорректные данные. Пожалуйста, введите название нового статуса еще раз.')
        print('Статус заметки может быть: выполнено, в процессе или отложено.')
print("Заметка:")       #вывод заметки с обновленным статусом
for key, value in note_.items():    #использование цикла для вывода заметки
    print(note_names[key], value)