#2. update_status.py: Проверка и обновление статуса заметки
#Функциональность:
#Показывает текущий статус заметки.
#Предлагает изменить статус на один из предложенных.
#Обрабатывает некорректный ввод.

#status = 'в процессе'   #текущий статус заметки
#from time import sleep  #при желании использовать задержку программы до того, как предложить сменить статус
#print('Текущий статус заметки:', status)
#sleep(1.5)
print("Заметка:")
note_ = {'Имя:': 'Елена', 'Заголовок:': 'Покупки', 'Описание:': 'Составить список покупок на неделю', 'Статус:':
    'В процессе', 'Дата создания:': '01-01-2025', 'Дедлайн:': '15-01-2025'}
for i, k in note_.items():      #использование цикла для вывода заметки
    print(i, k)

print('Введите новый статус заметки, указав его название:')    #предложение поменять статус с указанными вариантами
print('1. Выполнено')
print('2. В процессе')
print('3. Отложено')

while True:     #использование цикла для ввода нового статуса заметки
    status = input('Ваш выбор: ')
    if status.lower() == 'выполнено':
        note_['Статус:'] = 'Выполнено'
        print('Статус заметки успешно обновлён на: "Выполнено"!')
        break
    if status.lower() == ('в процессе'):
        note_['Статус:'] = 'В процессе'
        print('Статус заметки успешно обновлён на: "В процессе"!')
        break
    if status.lower() == ('отложено'):
        note_['Статус:'] = 'Отложено'
        print('Статус заметки успешно обновлён на: "Отложено"!')
        break
    else:   #подсказки в случае ввода некорректных данных
        print('Вы указали некорректные данные. Пожалуйста, введите название нового статуса еще раз.')
        print('Статус заметки может быть: выполнено, в процессе или отложено.')
print("Заметка:")       #вывод заметки с обновленным статусом
for i, k in note_.items():
    print(i, k)

#update_status = {"status": status}     #сохранение нового статуса в словарь
#print(update_status)